In [1]:
import pandas as pd
import numpy as np

In [3]:
a=pd.Series(np.random.random(10))
a

0    0.959687
1    0.739405
2    0.679753
3    0.069314
4    0.627693
5    0.728014
6    0.986670
7    0.515431
8    0.958217
9    0.148424
dtype: float64

In [4]:
colnames=['col1','col2','col3','col4']

In [14]:
b=pd.DataFrame([np.random.randint(20, size=10) for i in range(4)]).T
b.columns=colnames
b

   col1  col2  col3  col4
0     3    17    14    17
1    15     5     4    11
2     4    10    19     6
3    15    11     8    14
4     0     9    18     7
5    18    10     3     9
6     1    16    18     7
7     8    19     8     4
8    10     2    13    11
9     1    19     5    15

In [15]:
l=[i for i in range(10)]
pd.DataFrame(l)

   0
0  0
1  1
2  2
3  3
4  4
5  5
6  6
7  7
8  8
9  9

In [18]:
ll=[[i for i in range(5)] for j in range(10)]
pd.DataFrame(ll)

   0  1  2  3  4
0  0  1  2  3  4
1  0  1  2  3  4
2  0  1  2  3  4
3  0  1  2  3  4
4  0  1  2  3  4
5  0  1  2  3  4
6  0  1  2  3  4
7  0  1  2  3  4
8  0  1  2  3  4
9  0  1  2  3  4

In [19]:
dct={'a':[0,1,2,3,4,5],'b':[0,1,4,9,16,25],'c':[-1,-2,-3,-4,-5,-6]}

In [20]:
dct

{'a': [0, 1, 2, 3, 4, 5],
 'b': [0, 1, 4, 9, 16, 25],
 'c': [-1, -2, -3, -4, -5, -6]}

In [23]:
pd.DataFrame(dct)

   a   b  c
0  0   0 -1
1  1   1 -2
2  2   4 -3
3  3   9 -4
4  4  16 -5
5  5  25 -6

In [24]:
house_dict = {'Baker House': [7420, 'BrkSide', 1939, 5, 118000],
              'Beazley House': [14115, 'Mitchel', 1993, 5, 143000],
              'Dominguez House': [14260, 'NoRidge', 2000, 8, 250000],
              'Hamilton House': [6120, 'OldTown', 1931, 7, 129900],
              'James House': [11250, 'CollgCr', 2001, 7, 223500],
              'Martinez House': [9600, 'Veenker', 1976, 6, 181500],
              'Roberts House': [9550, 'Crawfor', 1915, 7, 140000],
              'Smith House': [8450, 'CollgCr', 2003, 7, 208500],
              'Snyder House': [10084, 'Somerst', 2004, 8, 307000],
              'Zuckerman House': [10382, 'NWAmes', 1973, 7, 200000]}

In [30]:
df=pd.DataFrame(house_dict).transpose()
colnames = ['LotSize','Neighborhood','YearBuilt','Quality','SalePrice']
df.columns=colnames

In [32]:
df2=pd.DataFrame.from_dict(house_dict,orient='index',columns=colnames)

In [33]:
df2

                 LotSize Neighborhood  YearBuilt  Quality  SalePrice
Baker House         7420      BrkSide       1939        5     118000
Beazley House      14115      Mitchel       1993        5     143000
Dominguez House    14260      NoRidge       2000        8     250000
Hamilton House      6120      OldTown       1931        7     129900
James House        11250      CollgCr       2001        7     223500
Martinez House      9600      Veenker       1976        6     181500
Roberts House       9550      Crawfor       1915        7     140000
Smith House         8450      CollgCr       2003        7     208500
Snyder House       10084      Somerst       2004        8     307000
Zuckerman House    10382       NWAmes       1973        7     200000

In [34]:
?pd.DataFrame.from_dict

In [36]:
a[4]

0.6276928646024726

In [41]:
df[['LotSize','Neighborhood']]

                LotSize Neighborhood
Baker House        7420      BrkSide
Beazley House     14115      Mitchel
Dominguez House   14260      NoRidge
Hamilton House     6120      OldTown
James House       11250      CollgCr
Martinez House     9600      Veenker
Roberts House      9550      Crawfor
Smith House        8450      CollgCr
Snyder House      10084      Somerst
Zuckerman House   10382       NWAmes

In [45]:
df['Neighborhood']['Smith House']

'CollgCr'

In [46]:
df.Neighborhood['Smith House']

'CollgCr'

In [52]:
df.LotSize>10000

Baker House        False
Beazley House       True
Dominguez House     True
Hamilton House     False
James House         True
Martinez House     False
Roberts House      False
Smith House        False
Snyder House        True
Zuckerman House     True
Name: LotSize, dtype: bool

In [54]:
df[df.LotSize>10000]

                LotSize Neighborhood YearBuilt Quality SalePrice
Beazley House     14115      Mitchel      1993       5    143000
Dominguez House   14260      NoRidge      2000       8    250000
James House       11250      CollgCr      2001       7    223500
Snyder House      10084      Somerst      2004       8    307000
Zuckerman House   10382       NWAmes      1973       7    200000

In [55]:
df[(df.LotSize>10000)&(df.YearBuilt>=2000)]

                LotSize Neighborhood YearBuilt Quality SalePrice
Dominguez House   14260      NoRidge      2000       8    250000
James House       11250      CollgCr      2001       7    223500
Snyder House      10084      Somerst      2004       8    307000

In [62]:
df[(df.LotSize>10000)&(df.YearBuilt>=2000)][['SalePrice','Quality']]

                SalePrice Quality
Dominguez House    250000       8
James House        223500       7
Snyder House       307000       8

In [63]:
df.loc[(df.LotSize>10000)&(df.YearBuilt>=2000),['SalePrice','Quality']]

                SalePrice Quality
Dominguez House    250000       8
James House        223500       7
Snyder House       307000       8

In [66]:
df.loc[['Baker House','James House'],'Quality']

Baker House    5
James House    7
Name: Quality, dtype: object

In [68]:
display(df.loc[(df.LotSize>10000)&(df.YearBuilt>=2000),['SalePrice','Quality']])

                SalePrice Quality
Dominguez House    250000       8
James House        223500       7
Snyder House       307000       8

In [78]:
df.iloc[0:3,1:4]

                Neighborhood YearBuilt Quality
Baker House          BrkSide      1939       5
Beazley House        Mitchel      1993       5
Dominguez House      NoRidge      2000       8

In [76]:
df.iloc[0:3,[1,3]]

                Neighborhood Quality
Baker House          BrkSide       5
Beazley House        Mitchel       5
Dominguez House      NoRidge       8

In [79]:
df.sample(1)

                LotSize Neighborhood YearBuilt Quality SalePrice
Zuckerman House   10382       NWAmes      1973       7    200000

In [80]:
df.sample(5)

              LotSize Neighborhood YearBuilt Quality SalePrice
James House     11250      CollgCr      2001       7    223500
Baker House      7420      BrkSide      1939       5    118000
Beazley House   14115      Mitchel      1993       5    143000
Smith House      8450      CollgCr      2003       7    208500
Roberts House    9550      Crawfor      1915       7    140000

In [81]:
df.head(3)

                LotSize Neighborhood YearBuilt Quality SalePrice
Baker House        7420      BrkSide      1939       5    118000
Beazley House     14115      Mitchel      1993       5    143000
Dominguez House   14260      NoRidge      2000       8    250000

In [82]:
df.tail(3)

                LotSize Neighborhood YearBuilt Quality SalePrice
Smith House        8450      CollgCr      2003       7    208500
Snyder House      10084      Somerst      2004       8    307000
Zuckerman House   10382       NWAmes      1973       7    200000

In [83]:
df.sum()

LotSize                                                    101231
Neighborhood    BrkSideMitchelNoRidgeOldTownCollgCrVeenkerCraw...
YearBuilt                                                   19735
Quality                                                        67
SalePrice                                                 1901400
dtype: object

In [84]:
df.SalePrice.sum()

1901400

In [85]:
df.mean()

LotSize       10123.1
YearBuilt      1973.5
Quality           6.7
SalePrice    190140.0
dtype: float64

In [86]:
df.mean().sum()

202243.3

In [87]:
df.max()

LotSize           14260
Neighborhood    Veenker
YearBuilt          2004
Quality               8
SalePrice        307000
dtype: object

In [89]:
df.min()

LotSize            6120
Neighborhood    BrkSide
YearBuilt          1915
Quality               5
SalePrice        118000
dtype: object